---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotConvertInstHostToWorkPlane
source: html/36165072-89cf-84db-a6c6-565a1c756dd7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotConvertInstHostToWorkPlane Property

Can't convert Instance's Host to Work Plane. Try resetting Host to a Level.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertInstHostToWorkPlane { get; }
```